{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
      }
    },
    "rich_text_9YTrrX": {
      "type": "rich-text",
      "blocks": {
        "text_DGatGC": {
          "type": "text",
          "settings": {
            "enlarge_text": true,
            "text": "<p>A day on the river with a professional guide from St. Peter’s is designed to maximize your enjoyment. All guide trips are tailored to the instructional needs of each individual. Each trip will build fundamental fly fishing skills, expand your understanding of local rivers and help perfect your fly presentation.  We are ready and willing to provide comprehensive instruction on casting, bug selection, rigging and fly fishing techniques.  Our overall goal is to increase your fly fishing knowledge and skills, all while having a pleasurable experience on the water.<\/p><p>Below you will find detailed information on what to expect during a St. Peter's guide trip, pricing for the various opportunities we offer, and details on our unique rental program.<\/p>"
          }
        }
      },
      "block_order": [
        "text_DGatGC"
      ],
      "settings": {
        "align_text": "center",
        "narrow_column": true,
        "divider": false
      }
    },
    "slideshow_YN9FcH": {
      "type": "slideshow",
      "blocks": {
        "image_aRfyPh": {
          "type": "image",
          "settings": {
            "title": "The Experience",
            "title_size": 80,
            "subheading": "",
            "link": "",
            "link_text": "",
            "text_align": "vertical-bottom horizontal-left",
            "image": "shopify:\/\/shop_images\/Jason-Guiding-Rainbow-1024x593_55a2d8a6-2512-40ec-8aab-889d14334cf2.jpg",
            "parallax_direction": "top",
            "overlay_opacity": 0
          }
        },
        "image_BYhdmK": {
          "type": "image",
          "settings": {
            "title": "",
            "title_size": 80,
            "subheading": "",
            "link": "",
            "link_text": "",
            "text_align": "vertical-bottom horizontal-left",
            "image": "shopify:\/\/shop_images\/IMG_6169.webp",
            "parallax_direction": "top",
            "overlay_opacity": 0
          }
        }
      },
      "block_order": [
        "image_aRfyPh",
        "image_BYhdmK"
      ],
      "settings": {
        "section_height": "650px",
        "mobile_height": "auto",
        "parallax": true,
        "style": "arrows",
        "autoplay": true,
        "autoplay_speed": 5,
        "lazyload_images": true
      }
    },
    "rich_text_XXNGPy": {
      "type": "rich-text",
      "blocks": {
        "text_jrB46D": {
          "type": "text",
          "settings": {
            "enlarge_text": true,
            "text": "<p>Your day on the river with a guide from St. Peter's Fly Shop is designed to maximize your enjoyment. All guide trips can be instructional...or we can just go out and help you catch fish. Part school, part fishing, our trips will build your fundamental fly fishing skills, expand your understanding of local entomology, work the kinks out of your presentation, or help you get rid of that annoying tailing loop. Let us know what we can do to maximize your enjoyment on stream and we'll do whatever we can to accommodate you.<\/p><p>Our guide trips include everything you'll need for your day on stream. We are pleased to provide our clients with the fine rods from the Sage Manufacturing and Scott Fly Rod Company. Our reels and lines come from leading manufacturers in the industry such as Waterworks Lamson, Hatch Reels and Ross Reels, Scientific Anglers, Rio Products. Wading equipment can be provided upon request.<\/p><p>Our full day float and wade trips include lunch and beverages on stream. Drinks and snacks are provided on half day trips. Do you have dietary restrictions or other special needs? Please let us know and we're happy to accommodate you.<\/p>"
          }
        }
      },
      "block_order": [
        "text_jrB46D"
      ],
      "settings": {
        "align_text": "center",
        "narrow_column": true,
        "divider": false
      }
    }
  },
  "order": [
    "main",
    "rich_text_9YTrrX",
    "slideshow_YN9FcH",
    "rich_text_XXNGPy"
  ]
}
