{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
      }
    },
    "text_columns_XJLGWD": {
      "type": "text-columns",
      "blocks": {
        "text_block_CDMRFB": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/g_permit_for_instructor.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Grant Houx",
            "text": "<p>Grant spends his time both working in the shop full time and guiding on local water and the North Platte River. In the shop his roles are inventory management, guide coordinator and most importantly relationship building with our customers. As a guide Grant is an integral part of St. Peter’s row team with over a decade of experience on the North Platte from North Gate to Casper. He has spent a significant amount of time traveling the world fly fishing from salt water destinations to Patagonia. In fly fishing, teaching is a driving facet of the sport for Grant. He is a Certified Casting Instructor who enjoys teaching people how to dial in their cast whether it is with a single or double handed rod.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_JNVXVT": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Jin-GT-Xmas.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Jin Choi",
            "text": "<p>Since moving to Fort Collins in 1991, Jin has been passionate about learning the local rivers and lakes. Although calling the northern Front Range home, his pursuit of any fish eager to chase a fly has led him to spend seasons in locations stretching from Alaska to the Caribbean. While there are not many things he enjoys more than time on the water, teaching others about flyfishing, fly tying, and entomology are just as rewarding. Even if you are unable to attend any of Jin's classes or arrange a guided trip with him, he is always happy to answer questions or just chat about your latest fishing adventure.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_yAhkUC": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/AA_permit_1d630ad3-4404-4587-aa6e-0115bd4d6c8a.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Aaron Alexander",
            "text": "<p>A Northern Colorado native, fly fishing has been a part of Aaron's life since he was given his father’s old fiberglass fly rod at age 12. Armed with his father's traditional fly fishing techniques, an arsenal of stillwater knowledge from his father-in-law, and a new-found love for spey casting and two-handed rods, Aaron is equally at home tossing dries on the Poudre, swinging flies on the Miracle Mile or float tubing the Delaney Buttes with sinking lines and streamers. With unending patience and undying enthusiasm, he truly enjoys sharing the fly fishing life style with everyone...whether it be on the water, in the shop or the local watering hole. When not on the water, he can be found tying last minute bugs for tomorrow's trip, picking the guitar or reading John Gierach's latest work.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_7rEQch": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/julia_big_bone_fish.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Julia Houx",
            "text": "<p>Julia began fishing in the traditional style as a child in Houston, Texas & Galveston bay area. When she moved to Colorado in 2001, Grant, now her husband, introduced her to fly fishing and his passion for it. His passion became contagious as he regularly sported his rod & reel on any journey to the mountains. Julia especially enjoys the dry fly fishing season that Colorado offers. You will find Julia on most days around the shop in our upstairs office.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_EJaLXt": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/jsmall_1.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Jason Small",
            "text": "<p>Jason started chasing trout as a young child in the Midwest before moving to beautiful Colorado over 20 years ago, Jason has pursued his love for fly fishing all over Colorado and New Mexico. He spent 8 years pursuing the elusive trout in the high mountain streams and gold medal waters of southwest Colorado before moving to Fort Collins 5 years ago. Jason now finds his home here on the banks of the Poudre River and many other local watersheds.<\/p><p>A day on the water with Jason is all about having fun and learning the skills to be a great angler. Jason's easy going personality and love for fly fishing is the perfect match for anglers of all skill level.<\/p><p>In his free time, Jason continues his passion for all things fly fishing, including teaching his young daughter Norah how to \"spot risers\" and tie the perfect fly. When Jason is not on the water he enjoys time with his family in the great outdoors; camping, hiking and enjoying nature.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_cbxJmQ": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/thomas_musky.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Thomas Wurster",
            "text": "<p>Thomas was born and raised in Illinois, where his passion for fishing started with bass and bluegill as a youngster.  It quickly evolved into an obsession and at the age of 16 he picked up his first fly rod. He chased pike, bass, and anything else that he could get a fly in front of.  He moved out to Colorado in 2013 to pursue a degree at Colorado State University in Natural Resources, Business, and trout of course.  When he wasn’t studying, Thomas was out learning new water.  With a shop like St. Petes in town, the world was at his fingertips.  Today, when he’s not in the shop, you can find Thomas stalking high alpine lakes in search for cutthroat, up in Wyoming looking for trout, or getting back to his roots and pike fishing.  But that’s not the extent of his knowledge.  He has also spent a great deal of time chasing snook, tarpon, bonefish and permit.  Don’t be afraid to pick his brain about any sort of fish.  Thomas loves sharing his passion for fly fishing, helping people put together pieces of the puzzle when they seem to be lost.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_ka9pwA": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Vince-Staff-Pic.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Vince Herera",
            "text": "<p>Growing up in Pueblo, Colorado,Vincespent a lot of his time fishing the tail waters of the Arkansas river. Like a lot of us,Vincewas introduced to conventional gear at a very young age. At the age of 13 he found a fly rod that was lying around the garage and decided to give it a go. The rest is history. Vince's passion for learning and reading has helped fuel his appreciation for angling, and his excitement for teaching and helping others. In 2018,Vinceleft his hometown and moved to Fort Collins with his girlfriend. Outside of the shop,Vinceloves to spend his time on the water, tossin' nymphs to feeding subsurface trout, tying flies, and spending as much time as he can with his friends and girlfriend. Angling will always be a huge part of Vince’s life.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_cUC6bD": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/big_perm_costa_20097c8e-2ed1-488d-b3cc-3635b103258f.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Cory D'Antonio",
            "text": "<p>Cory grew up fishing the freestone and limestone creeks of Pennsylvania chasing native brookies and browns, while also spending vast amounts of time on warm waters pursuing muskies and bass. Summer vacations growing up were spent with his four older brothers and parents out west fishing Montana, Wyoming and Colorado. His recent move to Colorado came after seeking out saltwater species in California along with golden trout in the high mountains. His passion and enthusiasm for chasing fish of any species and size is palpable and sure to be noticed by anyone he runs into, whether on the water or in the shop.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_LhPMpC": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/rigging_for_trout_class_a76895ca-404b-4f96-b00a-a04f8fb1614c.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Brett Muller",
            "text": "<p>Brett has spent his whole life in Colorado, growing up in the Denver area, and has plenty of knowledge of the watersheds we have near and far.  He is currently studying Natural Resources with a concentration in Tourism at Colorado State University.  When he isn't studying or working in the shop, you can most likely find him out on the water enjoying all that the Rocky Mountain west has to offer.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_hdJzrH": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/jay-bio-pic-2.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Jay Frazier",
            "text": "<p>Originally from Oklahoma, Jay fell in love with traditional fishing for catfish, sunfish, and bass. After moving to  Colorado in 2011, he was introduced to fly fishing and never looked back. Learning to fly fish on the South Platte came with some frustrations but has paid off in the long run. Jay can be found fishing the South and North Park lakes, the Colorado River, and our local rivers frequently between classes at CSU, where he is currently pursuing a degree in Supply Chain Management.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_V9MaLT": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/brody-profile-pic.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Brody Cinabro",
            "text": "<p>A Colorado native, Brody grew up in Fort Collins and began fishing at 3 years old with his grandpa. He picked up fly fishing at 14 and has been an avid fly angler ever since. In his free time, Brody can be found fishing various streams and rivers for trout, chasing carp and other warm water species, skiing, or just enjoying being outside.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_LLWzzp": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/rigging_for_trout_class_a76895ca-404b-4f96-b00a-a04f8fb1614c.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Brett Muller",
            "text": "<p>Brett has spent his whole life in Colorado, growing up in the Denver area, and has plenty of knowledge of the watersheds we have near and far.  He is currently studying Natural Resources with a concentration in Tourism at Colorado State University.  When he isn't studying or working in the shop, you can most likely find him out on the water enjoying all that the Rocky Mountain west has to offer.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "text_block_CDMRFB",
        "text_block_JNVXVT",
        "text_block_yAhkUC",
        "text_block_7rEQch",
        "text_block_EJaLXt",
        "text_block_cbxJmQ",
        "text_block_ka9pwA",
        "text_block_cUC6bD",
        "text_block_LhPMpC",
        "text_block_hdJzrH",
        "text_block_V9MaLT",
        "text_block_LLWzzp"
      ],
      "settings": {
        "title": "",
        "align_text": "center",
        "divider": false
      }
    }
  },
  "order": [
    "main",
    "text_columns_XJLGWD"
  ]
}
