{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
      }
    },
    "rich_text_7CMDYe": {
      "type": "rich-text",
      "blocks": {
        "heading_jjzgK6": {
          "type": "heading",
          "settings": {
            "title": "{{ page.title }}"
          }
        },
        "text_9yX7q3": {
          "type": "text",
          "disabled": true,
          "settings": {
            "enlarge_text": true,
            "text": "<p>Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>"
          }
        }
      },
      "block_order": [
        "heading_jjzgK6",
        "text_9yX7q3"
      ],
      "settings": {
        "align_text": "center",
        "narrow_column": true,
        "divider": false
      }
    },
    "text_columns_TGHagA": {
      "type": "text-columns",
      "blocks": {
        "text_block_3W363R": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/RB-guide-profile-2-2.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Ryan Barrick",
            "text": "<p>Ryan started working for St. Peter’s in the spring of 2016, and spent most of his days in the south shop until he realized that the only place he liked better was the river.Originally from Tennessee, Ryan counts himself lucky to be spending the majority of his time rowing a boat on trout rivers in Wyoming and Colorado.Equally comfortable guiding the North Platte, Cache la Poudre, Big Thompson or even Horsetooth Reservoir, Ryan gets a real kick out of sharing his enthusiasm, knowledge, and skillset with others. A more laid back and friendly approach to guiding makes a day fishing with Ryan a positive experience that he hopes will leave his guests with a better understanding of the sport and the water we are lucky enough to enjoy.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_CLCCPj": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Josh-guide-pic-2-1.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Josh Henriksen",
            "text": "<p>Josh grew up in Fort Collins and has been exploring the Poudre Canyon and wild<br\/>places since a young age. Nature has been Josh’s “happy place” his entire life. He holds<br\/>the belief that when one immerses themselves in nature, they learn not just about plants,<br\/>animals and landscape, but more importantly about oneself. Josh is at home in the<br\/>woods, and hunting wild fish with a fly rod is a perfect fit. Fly fishing is definitely a<br\/>lifestyle for him.<\/p><p>Wading Colorado’s rivers, rowing bigger waters in Wyoming, hiking to high<br\/>mountain lakes and tying flies are ways Josh is always trying to learn more. He stays<br\/>thoroughly embedded in fish up to his gills and would have it no other way!<\/p><p>Becoming a guide seemed inevitable in Josh’s life. He loves to share his<br\/>knowledge about trout and their ecosystem. His passion for guiding is obvious with a<br\/>day spent on the water with him. “Sharing these amazing places and beautiful fish with<br\/>people is a dream come true for me! Seeing people connect with their natural<br\/>environment and the experience it gives them is my motivation each day.” -Josh<\/p><p><\/p>",
            "button_label": "Josh's Instagram",
            "button_link": "https:\/\/www.instagram.com\/joshtheflyfishingguide\/"
          }
        },
        "text_block_HpDNcw": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image_mask": "none",
            "image_width": 650,
            "title": "Luke Barrick",
            "text": "<p>Luke grew up fishing and hunting in Tennessee. Since relocating to Northern Colorado in 2016, he has fallen into a seasonal rhythm with the water. Spending his off-season skiing in the high country before heading back down the hill with the snowpack each spring to dust off the oars and get back on the river. While Luke is especially fond of presenting dry flies to trout on the rise, he is no purist and his southern upbringing left him with a soft spot for split shot and indicators. He brings a mountaineering approach to group dynamics and risk management on the water and is grateful to be able to share special moments in the backcountry with his friends and clients.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_WnK9BJ": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image_mask": "none",
            "image_width": 650,
            "title": "Matt Nisbet",
            "text": "<p>A Fort Collins Native who grew up fly fishing all over the front range, Matt is no<br\/>stranger to our local waters.  Having a family property in the Saratoga region of<br\/>Wyoming, the North Platte river and high alpine lakes of south eastern Wyoming are<br\/>just some of the regional waters that Matt calls home. Due to his love of hunting and<br\/>the chase of wild things, if you find Matt on the water, you’ll usually find him with a<br\/>streamer in his hand! If you don’t find him on the water, he’s either tying flies,<br\/>searching for Whitetail bucks, or chasing wild turkeys through the hills of Fort Collins,<br\/>and of course, chasing the beautiful trout of our wonderful home waters!<\/p>",
            "button_label": "",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "text_block_3W363R",
        "text_block_CLCCPj",
        "text_block_HpDNcw",
        "text_block_WnK9BJ"
      ],
      "settings": {
        "title": "",
        "align_text": "center",
        "divider": false
      }
    }
  },
  "order": [
    "main",
    "rich_text_7CMDYe",
    "text_columns_TGHagA"
  ]
}
