{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
      }
    },
    "rich_text_7CMDYe": {
      "type": "rich-text",
      "blocks": {
        "heading_jjzgK6": {
          "type": "heading",
          "settings": {
            "title": "{{ page.title }}"
          }
        },
        "text_9yX7q3": {
          "type": "text",
          "disabled": true,
          "settings": {
            "enlarge_text": true,
            "text": "<p>Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>"
          }
        }
      },
      "block_order": [
        "heading_jjzgK6",
        "text_9yX7q3"
      ],
      "settings": {
        "align_text": "center",
        "narrow_column": true,
        "divider": false
      }
    },
    "text_columns_TGHagA": {
      "type": "text-columns",
      "blocks": {
        "text_block_3W363R": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/RB-guide-profile-2-2.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Ryan Barrick",
            "text": "<p>Ryan started working for St. Peter’s in the spring of 2016, and spent most of his days in the south shop until he realized that the only place he liked better was the river.Originally from Tennessee, Ryan counts himself lucky to be spending the majority of his time rowing a boat on trout rivers in Wyoming and Colorado.Equally comfortable guiding the North Platte, Cache la Poudre, Big Thompson or even Horsetooth Reservoir, Ryan gets a real kick out of sharing his enthusiasm, knowledge, and skillset with others. A more laid back and friendly approach to guiding makes a day fishing with Ryan a positive experience that he hopes will leave his guests with a better understanding of the sport and the water we are lucky enough to enjoy.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_CLCCPj": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Josh-guide-pic-2-1.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Josh Henriksen",
            "text": "<p>Josh grew up in Fort Collins and has been exploring the Poudre Canyon and wild<br\/>places since a young age. Nature has been Josh’s “happy place” his entire life. He holds<br\/>the belief that when one immerses themselves in nature, they learn not just about plants,<br\/>animals and landscape, but more importantly about oneself. Josh is at home in the<br\/>woods, and hunting wild fish with a fly rod is a perfect fit. Fly fishing is definitely a<br\/>lifestyle for him.<\/p><p>Wading Colorado’s rivers, rowing bigger waters in Wyoming, hiking to high<br\/>mountain lakes and tying flies are ways Josh is always trying to learn more. He stays<br\/>thoroughly embedded in fish up to his gills and would have it no other way!<\/p><p>Becoming a guide seemed inevitable in Josh’s life. He loves to share his<br\/>knowledge about trout and their ecosystem. His passion for guiding is obvious with a<br\/>day spent on the water with him. “Sharing these amazing places and beautiful fish with<br\/>people is a dream come true for me! Seeing people connect with their natural<br\/>environment and the experience it gives them is my motivation each day.” -Josh<\/p><p><\/p>",
            "button_label": "Josh's Instagram",
            "button_link": "https:\/\/www.instagram.com\/joshtheflyfishingguide\/"
          }
        },
        "text_block_HpDNcw": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Luke-B-Guide-photo.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Luke Barrick",
            "text": "<p>Luke grew up fishing and hunting in Tennessee. Since relocating to Northern Colorado in 2016, he has fallen into a seasonal rhythm with the water. Spending his off-season skiing in the high country before heading back down the hill with the snowpack each spring to dust off the oars and get back on the river. While Luke is especially fond of presenting dry flies to trout on the rise, he is no purist and his southern upbringing left him with a soft spot for split shot and indicators. He brings a mountaineering approach to group dynamics and risk management on the water and is grateful to be able to share special moments in the backcountry with his friends and clients.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_WnK9BJ": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Matt-guide-pic.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Matt Nisbet",
            "text": "<p>A Fort Collins Native who grew up fly fishing all over the front range, Matt is no<br\/>stranger to our local waters.  Having a family property in the Saratoga region of<br\/>Wyoming, the North Platte river and high alpine lakes of south eastern Wyoming are<br\/>just some of the regional waters that Matt calls home. Due to his love of hunting and<br\/>the chase of wild things, if you find Matt on the water, you’ll usually find him with a<br\/>streamer in his hand! If you don’t find him on the water, he’s either tying flies,<br\/>searching for Whitetail bucks, or chasing wild turkeys through the hills of Fort Collins,<br\/>and of course, chasing the beautiful trout of our wonderful home waters!<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_VUVfH9": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/xander-guide-pic-1.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Xander Elliot",
            "text": "<p>Xander grew up near Denver and enjoyed a childhood of camping, hunting and fishing all over Colorado. He joined the St Peter’s crew after relocating up to Fort Collins while studying Journalism at Colorado State University.He enjoys spending time in the high country exploring alpine lakes and anywhere there are good fish to be found. When he’s not fishing you can find him trail running on the local single track, building furniture, or paddle boarding with his wife and dog.Xander specializes in an education-first approach to guiding and enjoys teaching anglers of all ages and skill levels.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_H4tjBb": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/dan-guide-pick-1.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Dan Nicks",
            "text": "<p>Originally from South Carolina, Dan was raised in a Military family, so home was where the Air Force sent them. He hopped around most his life, along the way developing a deep love for wilderness, and of course, fishing! Dan grew up throwing conventional gear for Bass, but after moving to Colorado in 2006, and spending years fooling around in the mountains, it was only a matter of time before a fly rod ended up in his hand and his passion for all things wild and fishy was elevated to a whole new level.<\/p><p>From rivers and lakes, to tailwaters and alpine streams, Dan has fished his way all over Colorado and beyond, but the Cache La Poudre River will always be home water to him. For the past ten years, he’s been creeping around the banks of our local fisheries stalking trout, carp, bass, and anything else he can probably throw a fly at. He joined St. Peter’s in 2017 and discovered a whole new love for guiding and teaching the sport of fly fishing. When he’s not talking bourbon at his day job as a liquor buyer, he’s out guiding and chasing fish on the weekends. Whether you’re a seasoned angler, or a total beginner, a day on the water with Dan is all about learning, enjoying the beauty of our local waters, and putting a few fish in the net along the way.<\/p><p><\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_VKY4Em": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Dawson-guide-pic.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Dawson Balmer",
            "text": "<p>Dawson’s a local kid who grew up in Fort Collins. Having a family of avid anglers he had a fly rod in his hand at a young age and it has made him very passionate about the art of angling and conservation. Currently a student at CSU studying watershed science, he has lots of knowledge on our local watersheds the Poudre and the Big Thompson. You can find him in his off time up in Wyoming searching for trophy trout, on our local waters, or knee deep in Colorado powder.  Dawson provides an educational approach to the natural processes that occur on our watersheds and can give local insight on angling in northern Colorado and Wyoming. You’ll be sure to learn a thing or two about the natural systems and putting fish in the net with Dawson!<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_8qzNHY": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image_mask": "none",
            "image_width": 650,
            "title": "Neal Warner",
            "text": "<p>Neal BIO<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_hpVamn": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/C.Murph_Guide.Pic.jpg",
            "image_mask": "square",
            "image_width": 650,
            "title": "Connor Murphy",
            "text": "<p>Born and raised in Fort Collins, Connor has been darkening the doorstep of St. Pete’s and<br\/>roaming the Poudre since before he could walk. Another addition to a long line of anglers, fly fishing has truly been an all-consuming passion for Connor since childhood. Connor has been guiding the Poudre for St. Pete’s for over a decade and has been fortunate enough to guide and fish all over the world. In addition to being an IFFF certified casting instructor, Connor teaches many of our classes at the shop, both in the field and the classroom. Graduating from CSU with a BS in Fisheries Biology, Connor currently spends most of his time working as a fisheries biologist for FlyWater inc., a local river restoration company. When he’s not wandering through a willow gallery somewhere Connor can be found at home with his wife and son, out puttering around in the garden or nestled in behind his fly tying desk.<\/p><p><br\/>For Connor, nothing is more enjoyable than spending time in a river, and no river is more<br\/>enjoyable to spend time in than the Cache la Poudre.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_gPUWii": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/jsmall.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Jason Small",
            "text": "<p>Jason started chasing trout as a young child in the Midwest before moving to beautiful Colorado over 20 years ago, Jason has pursued his love for fly fishing all over Colorado and New Mexico. He spent 8 years pursuing the elusive trout in the high mountain streams and gold medal waters of southwest Colorado before moving to Fort Collins 5 years ago. Jason now finds his home here on the banks of the Poudre River and many other local watersheds.<\/p><p>A day on the water with Jason is all about having fun and learning the skills to be a great angler. Jason's easy going personality and love for fly fishing is the perfect match for anglers of all skill level.<\/p><p>In his free time, Jason continues his passion for all things fly fishing, including teaching his young daughter Norah how to \"spot risers\" and tie the perfect fly. When Jason is not on the water he enjoys time with his family in the great outdoors; camping, hiking and enjoying nature.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_VpXbrQ": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/Kyle-Stack.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Kyle Stack",
            "text": "<p>Kyle pursues his love of fly-fishing on the Poudre River during his summer vacations away from the local high school where he is an administrator. His passion for every aspect of fly-fishing- from tying flies, to reading water, to river entomology, and enjoying the tranquility of the Poudre Canyon, informs his guiding and helps define his way of life. Kyle has explored and fished numerous rivers around Colorado, Wyoming, Montana, and New Mexico, although he is always called back to his favorite local river, the Cache la Poudre. Kyle is a natural and encouraging teacher and enjoys sharing all aspects of fishing and the river with clients. He has shared his passion as a guide and teacher at St. Pete’s Fly Shop since 2008.  When not guiding on the water, Kyle can be found teaching our Signature Fly Fishing Class, Intro to Fly Fishing, or Angler's Entomology. A day on the river or in the classroom with Kyle is a great introduction for the first timer or a fine tuning for the accomplished angler.<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_xwqrai": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/jarrod-Collins-bio-1.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Jarrod Collins",
            "text": "<p>Jarrod is a Colorado native and has spent his life playing outside and in the mountains of our beautiful Centennial State! A Real Estate & Marketing Consultant by trade, Fly Fishing is all about the passion & the stoke level for Jarrod.<\/p><p>While the Poudre is home water, you can find him on just about anything wet that may have a fish--From floating freestones & tailwaters to high country cutts to top water bass action & carp, if it swims, Jarrod can be found chasing it.<\/p><p>Guiding for Jarrod is a true passion project and the passion lies in teaching and building a foundation  as not only an angler but as a steward and a sportsman.  Whether it is your first day ever with a fly rod or you are a skilled angler looking to master a new skill, Jarrod takes pride in keeping the smiles wide and creating a day of memories that will be the foundation for a lifetime of fishing.  The adventure, the beauty & the learning is the Juice that makes the Squeeze worth it all!<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_aMCknp": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image_mask": "none",
            "image_width": 650,
            "title": "Mike Graham",
            "text": "<p>Mike G Bio and pic needed<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_jiBRi6": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify:\/\/shop_images\/kellen_guide_pic.jpg",
            "image_mask": "none",
            "image_width": 650,
            "title": "Kellen Chaney",
            "text": "<p>Kellen is a Fort Collins local who started fly fishing on the Poudre and Big Thompson rivers at a very young age. Now attending the University of Wyoming, Kellen spends his days chasing trophy Trout and Carp around the Front Range and surrounding areas. With a very relaxed and educational approach to guiding, a day on the water with Kellen will be one to remember!<\/p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "text_block_Hna7NP": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image_mask": "none",
            "image_width": 650,
            "title": "Jake Baldwin",
            "text": "<p>Guide ?<\/p>",
            "button_label": "",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "text_block_3W363R",
        "text_block_CLCCPj",
        "text_block_HpDNcw",
        "text_block_WnK9BJ",
        "text_block_VUVfH9",
        "text_block_H4tjBb",
        "text_block_VKY4Em",
        "text_block_8qzNHY",
        "text_block_hpVamn",
        "text_block_gPUWii",
        "text_block_VpXbrQ",
        "text_block_xwqrai",
        "text_block_aMCknp",
        "text_block_jiBRi6",
        "text_block_Hna7NP"
      ],
      "settings": {
        "title": "",
        "align_text": "center",
        "divider": false
      }
    }
  },
  "order": [
    "main",
    "rich_text_7CMDYe",
    "text_columns_TGHagA"
  ]
}
